data/Parm_PH_29/alpha_05/alpha_05_7071_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0335685081986856 1.00047658303879 0)
(0.0996215684768388 0.991791836953714 1.90947401762458e-18)
(0.158733591306196 0.962917889843891 1.5927963586462e-17)
(0.206587815599667 0.916457114884821 -1.52696868648624e-17)
(0.246498505439019 0.86261306782839 0)
(0.282640666431264 0.806173212220935 0)
(0.317050395213997 0.7486820580008 -8.6831093106727e-18)
(0.350989343913727 0.690914780687017 -9.13694501831374e-20)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0335690275286261 0.999693889251279 0)
(0.0994414107947632 0.991044162718845 0)
(0.15829093079975 0.962415977054515 0)
(0.206060430486753 0.916154029707829 0)
(0.245977171101906 0.862280929909244 0)
(0.282133757651782 0.805706042379331 0)
(0.31654837277333 0.748040667220008 0)
(0.350481693151915 0.690085035558101 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0294625 2.024 0)
(0.0883875 2.024 0)
(0.1473125 2.024 0)
(0.2062375 2.024 0)
(0.2651625 2.024 0)
(0.3240875 2.024 0)
(0.3830125 2.024 0)
(0.4419375 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
