data/Parm_PH_29/alpha_05/alpha_05_7071_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.02172034 -0.00066546 0.00000000 0.00037193 0.00000000 0.01826889)
(-0.00422261 0.00045852 0.00000000 -0.00005564 0.00000000 -0.00259181)
(0.00133107 -0.00121740 0.00000000 0.00075434 0.00000000 0.00205927)
(0.00052100 -0.00018317 0.00000000 -0.00037468 0.00000000 0.00129157)
(0.00007371 -0.00023098 0.00000000 0.00052439 0.00000000 0.00144654)
(0.00002839 -0.00019213 0.00000000 0.00053804 0.00000000 0.00221765)
(0.00004160 -0.00001843 0.00000000 -0.00001394 0.00000000 0.00096124)
(0.00005143 -0.00009528 0.00000000 0.00023963 0.00000000 0.00190888)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
